# 1. Импортировать NumPy под именем np.
import numpy as np

# 3. Создать вектор (одномерный массив) размера 10, заполненный нулями.
a = np.zeros((10))
print(a)

# 4. Создать вектор размера 10, заполненный единицами.
a = np.ones((10))
print(a)

# 5 Создать вектор размера 10, заполненный числом 2.5.
a = np.array([2.5] * 10) # Z = np.full(10, 2.5)
print(a)

# 6
